import dayjs from "dayjs";
const string = `
18:23/7.21	奶粉5ml
20:24	拉了少量大便
20:39	一滴大便
23:52	拉大便
23:55	喝奶5ml
02:50/7.22	大便小便
04:13	打嗝
06:38	大便小便
07:16	喝奶5ml
10:22	大小便
14:23	益生菌两勺子
15:16	小便和大便较多
15:38	喝母乳
18:00	大便和小便
20:13	牛奶10ml
22:40	牛奶15ml
00:39/7.23	牛奶13ml
03:49	母乳一些，牛奶15ml，小便
6:29	母乳一些，之后吐了一点，大便小便
7:48	母乳3ml
9:04	益生菌20ml
11:09	牛奶8ml
13:13	牛奶10ml
15:38	牛奶10ml，小便
18:00	牛奶6ml，母乳一些
20:00	拉小便
20:27	12ml牛奶母乳一些
22:49	10ml
01:11/7.24	15ml 小便
02:46	母乳
05:52	牛奶10ml
08:48	牛奶16ml
12:04	母乳一些，牛奶
13:47	母乳一些
14:08	牛奶30ml
18:18	牛奶10ml
21:00	大便
21:09	牛奶15ml
00:55/7.25	牛奶7ml母乳一点点
02:36	大便和小便
02:56	26ml牛奶
06:00	30ml
08:00	大便小便
11:14	大便
13:33	大便和母乳少量
14:03	母乳多量
17:13	牛奶28ml
20:00	母乳一些
23:26	牛奶40ml，母乳少量
23:50	小便
3:13/7.26	母乳先，牛奶10ml后不吃了，推测已经吃饱饱，拉了大便和小便
4:41	牛奶35ml
09:00	母乳先，牛奶30ml，大便小便
10:13	牛奶5ml
13:38	母乳，30ml牛奶
13:44	大便小便
17:00	小便
17:40	喝奶15ml
19:43	小便大便
20:30	牛奶35ml
23:50	大小便，喝奶25ml
04:08/7.27	喝奶24ml
18.00/7.31	喝奶10ml
19:33	喝奶50ml
20:29	喝奶50ml
0:41/8.1	母乳，牛奶18ml
4:16	牛奶105ml
8:00	小便
8:22	20ml牛奶
11:00	50ml牛奶
14:04	大便小便
14:50	70ml牛奶
18:37	小便大便
19:06	40ml牛奶
19:58	20ml牛奶
23:19	大便小便
23:40	30ml牛奶
04:00/8.2	70ml牛奶
4:44	20ml牛奶
8:41	小便一次
8:49	牛奶70ml
12:39	小便，大便
13:17	牛奶50ml
14:06	小便
14:30	牛奶20ml
17:57	小便一次
17:58	牛奶50ml
22:05	小便
22:55	40ml牛奶母乳一些，小便
1:56/8.3	大便小便
3:27	100ml牛奶母乳一些
7:54	小便，50ml牛奶，母乳一些
10:47	大便小便一次
12:05	50ml牛奶母乳一些
14:36	小便一次
14:49	40ml牛奶
17:30	50ml牛奶
20:30	大便一次
20:30	母乳一些，牛奶70ml
21:31	牛奶20ml
0:20/8.4	大便小便
0:20	牛奶50ml+20ml
4:08	小便
04:08	牛奶60ml
8:02	小便
8:02	母乳一些，牛奶30ml
11:01	大便小便
11:50	50ml牛奶，母乳一些
13:00	10ml牛奶，大便
15:30	牛奶50ml小便
19:30	牛奶40ml母乳一些
21:00	牛奶10ml，母乳一些
1:00/8.5	小便，母乳一些，牛奶80ml
2:00	大便小便一点点水
4:00	50ml牛奶
9:00	60ml牛奶+30ml
13:00	大便，牛奶60ml
16:30	牛奶50ml，小便
20:40	小便，90ml牛奶母乳一些
3:29/8.6	牛奶80ml，小便，母乳
8:00	牛奶50ml，小便，母乳
11:43	大便小便
12:30	牛奶60ml，母乳一些
16:01	牛奶60ml，小便
`;

const list = string.split("\n").filter((item) => item.trim());
const listReverse = list.map((item) => item.split("\t"));
let _month = 0;
let _day = 0;
let prevDayjs = dayjs("2025-1-1");
const temp1 = listReverse.map((item) => {
  const [datetime, note] = item;
  const [time, date] = datetime.split("/");
  if (date) {
    const [month, day] = date.split(".");
    _month = parseInt(month);
    _day = parseInt(day);
  }
  let instance = dayjs(`2025-${_month}-${_day} ${time}`);
  if (instance.isBefore(prevDayjs)) {
    debugger;
    instance = instance.add(12, "h");
  }
  prevDayjs = instance;
  return [instance.format("YYYY-MM-DD HH:mm:ss"), note];
});
console.log(temp1);
// 2025-8-6号
debugger;
