import dayjs from "dayjs";
const string = `
4:00	牛奶🥛50ml/小便
1:10/8.28	小便/母乳/牛奶🥛60ml
20:10	小便/大便/牛奶🥛90ml
15:30	小便
15:00	牛奶🥛120ml/大便/小便
12:10	牛奶🥛70ml/小便
9:20	牛奶🥛50ml/大便/小便
4:30	牛奶🥛80ml/小便
1:45	牛奶🥛30ml/小便
0:30/8.27	牛奶🥛60ml/小便/大便
21:20	牛奶🥛60ml/小便/母乳
18:00	牛奶🥛80ml
17:40	大便/小便
14:50	牛奶🥛80ml/大便/小便
11:30	牛奶🥛50ml/水/小便/母乳
10:00	母乳/牛奶🥛70ml/小便
5:00	牛奶🥛70ml/大便/小便/母乳
1:30/8.26	牛奶🥛80ml/大便/小便
22:10	牛奶🥛60ml/小便/母乳
18:40	牛奶🥛60ml/大便
15:45	牛奶🥛30ml/大便/小便/母乳
13:30	牛奶🥛15ml
12:30	牛奶🥛110ml/大便/小便/母乳
7:45	牛奶🥛50ml/小便
4:35	牛奶🥛60ml/小便/母乳
2:00/8.25	牛奶🥛50ml/小便/母乳
22:50	牛奶🥛80ml/母乳/小便
19:15	牛奶🥛100ml/小便/大便
17:40	母乳/大便/小便
15:40	牛奶🥛60ml/小便
12:55	母乳/牛奶🥛50ml/小便
10:15	牛奶🥛30ml
9:25	小便/牛奶🥛80ml
4:55/8.24	牛奶🥛65ml/母乳/小便
23:30	小便/大便/牛奶🥛25ml
22:40	牛奶🥛55ml/母乳
20:20	小便/大便/牛奶🥛50ml
17:35	小便/母乳/牛奶🥛50ml
14:40	小便/牛奶🥛70ml
12:10	牛奶🥛30ml
11:35	牛奶🥛50ml
10:05	小便/大便
9:05	牛奶🥛50ml
7:32	母乳/小便/牛奶🥛80ml/大便
3:50	牛奶🥛80ml/母乳/小便
1:00/8.23	牛奶🥛80ml/母乳/小便
22:15	牛奶🥛80ml/小便/大便
18:45	牛奶🥛50ml/母乳/水💧
17:00	小便
15:45	35ml牛奶🥛
15:25	小便/大便/母乳/水💧10ml
14:30	小便/牛奶80ml/母乳/大便
11:30	小便/牛奶🥛50ml/母乳
8:00	牛奶🥛50ml/小便
5:55	牛奶🥛50ml小便
2:00	牛奶🥛35ml
1:50	小便
1:20	牛奶🥛15ml
0:30	牛奶🥛50ml
0:10/8.22	大便/小便
23:30	牛奶🥛50ml/母乳/小便
22:00	牛奶🥛25ml
21:30	牛奶🥛50ml/大便/小便
19:40	牛奶🥛80ml/大便/小便/母乳
16:40	牛奶50ml/母乳10ml
13:35	牛奶55ml🥛/小便/水💧10ml/母乳
10:25	牛奶🥛50ml/小便
7:50	牛奶🥛80ml/小便/大便
2:55/8.21	牛奶🥛50lml/小便
23:40	牛奶🥛100ml/小便
20:10	牛奶🥛45ml/小便
17:00	牛奶🥛50ml/母乳
15:00	牛奶🥛30ml
14:10	牛奶🥛100ml/母乳/小便
8:57	牛奶90ml/小便
4:41	牛奶🥛40ml/小便/母乳
0:45/8.20	牛奶🥛100ml/小便/母乳 
21:10	牛奶🥛50ml/小便/母乳
17:55	牛奶🥛50ml
16:50	牛奶🥛50ml/大便💩/小便/母乳
14:10	牛奶🥛50ml/小便
12:30	牛奶🥛50ml/小便/母乳
8:30	牛奶🥛50ml/母乳
4:00	牛奶50ml大便小便
3:30/8.19	牛奶🥛100ml/母乳/大便💩/小便
23:04	牛奶🥛30ml30ml牛奶
22:33	牛奶50ml小便母乳
19:00	牛奶75ml大便小便
16:10	牛奶🥛20ml
13:30	20ml牛奶🥛
12:48	大便小便母乳牛奶100ml
9:49	50ml牛奶
8:00	母乳一些小便
5:00	牛奶50ml小便
2:00/8.18	牛奶🥛70ml/小便
22:10	牛奶🥛10ml
21:40	牛奶🥛30ml/大便
21:00	牛奶🥛20ml
20:30	牛奶🥛50ml/大便/小便/母乳
17:30	牛奶🥛50ml/小便/母乳
14:10	牛奶🥛50ml/母乳/小便
10:20	牛奶🥛50ml/母乳/
6:30	牛奶🥛100ml/大便/小便
3:00/8.17	牛奶🥛50ml/小便/母乳
23:30	牛奶🥛100ml/小便
19:00	80ml牛奶🥛/母乳/小便大便💩
14:30	20ml牛奶🥛
14:00	小便/母乳/50ml牛奶🥛
10:30	20ml
9:40	小便/牛奶🥛50ml
9:10	母乳/小便
5:04	100ml牛奶大便小便
1:30/8.16	50ml小便
23:00	50ml小便
21:30	牛奶50ml
19:08	牛奶50ml
6:20	牛奶🥛50ml/大便💩/小便
3:30	牛奶🥛50ml/母乳/小便
12:00	牛奶🥛50ml/母乳/小便
9:50	50ml牛奶
9:00	大便小便母乳牛奶
5:30	牛奶🥛50ml/小便
1:33/8.15	50ml牛奶
12:55	大便💩/小便/60ml牛奶🥛
12:14	大便小便
11:00	牛奶50ml母乳一些
8:00	牛奶🥛50ml/母乳一些
19:27	大便小便牛奶50ml
15:00	大便小便牛奶60ml
12:00	小便牛奶70ml
9:00	牛奶50ml
6:00	70ml牛奶，小便
3:10/8.14	160ml牛奶大便小便
9:00	100ml牛奶，大便小便
4:30	60ml牛奶🥛/小便
4:00	大便💩
1:30	牛奶🥛50ml
12:25	牛奶🥛60ml
8:30	牛奶50ml🥛
5:10	牛奶🥛50ml
4:40	牛奶🥛50ml
4:10/8.13	牛奶🥛50ml/大便💩/小便/母乳一些
11:20	牛奶🥛50ml
10:30	小便/牛奶🥛50ml（吐奶/呛奶）/母乳一些
20:19	大便小便
7:00	牛奶🥛80m l/小便
4:00	牛奶🥛35ml
3:00	小便/牛奶🥛50ml
12:00	大便💩/小便/牛奶🥛80ml
9:12	50ml牛奶
7:30	小便
4:00	牛奶🥛70ml
2:30/8.12	大便💩/小便/牛奶70ml🥛
10:30	大便💩/小便/牛奶🥛80ml
7:50	80ml牛奶🥛
18:56	小便，大便一点点
4:50	牛奶🥛50ml
4:00	小便/母乳一些
2:10	大便小便💩
13:28	牛奶90ml小便
12:25	小便
9:50	20ml牛奶🥛/母乳一些
9:00	小便
6:25	牛奶🥛60ml
6:00	小便/母乳一些
2:00	大便小便/50ml牛奶🥛
1:20/8.11	小便/牛奶🥛80ml/母乳一些
9:10	小便/牛奶🥛60ml
8:20	母乳一些
5:00	30ml牛奶🥛
4:30	大便💩/
4:00	大便💩/母乳一些/牛奶🥛40ml
15:40	大便💩
3:15	小便
12:00	小便/牛奶🥛50ml/母乳一些
8:50	牛奶🥛50ml/小便
4:50	10ml牛奶🥛
3:55	牛奶🥛130ml/母乳一些
3:30	大便💩小便
3:00	大便💩
2:02/8.10	小便，母乳一些
10:10	牛奶🥛30ml
9:55	母乳一些
9:10	小便大便💩
7:20	牛奶🥛80ml
7:00	小便
3:00	牛奶🥛30ml
2:15	牛奶🥛80ml/大便💩
1:00	小便/母乳一些
10:10	牛奶40ml
9:30	母乳一些，小便
6:04	70ml牛奶小便
2:00/8.9	牛奶60ml小便
22:18	牛奶5ml
22:10	牛奶25ml
21:28	牛奶10ml
21:10	大便小便
20:30	牛奶🥛50ml/母乳一些/小便
16:40	牛奶🥛60ml/母乳一些
16:00	大便小便
12:23	80ml牛奶🥛
12:00	小便
8:00	40ml牛奶🥛/大便小便
7.30	30ml牛奶🥛/小便/母乳一些
2:36/8.8	60ml牛奶/小便
20:56	50ml牛奶🥛
20:35	小便
19:57	30ml牛奶🥛
18:56	25ml牛奶
18:10	25ml牛奶🥛
17:10	母乳10ml/牛奶🥛50ml
16:50	大便小便
13:27	牛奶80ml
12:56	大便一次
10:00	牛奶50ml，小便
7:09	60ml牛奶，大便，小便
3:30	50ml牛奶🥛/小便
00:30/8.7	牛奶🥛45ml
23:50	牛奶🥛5ml/小便
20:20	牛奶25ml
19:48	牛奶50ml，大便
19:30/8.6	小便
`;

const list = string.split("\n").filter((item) => item.trim());
const listReverse = list.reverse().map((item) => item.split("\t"));
let _month = 0;
let _day = 0;
let prevDayjs = dayjs("2025-1-1");
const temp1 = listReverse.map((item) => {
  const [datetime, note] = item;
  const [time, date] = datetime.split("/");
  if (date) {
    const [month, day] = date.split(".");
    _month = parseInt(month);
    _day = parseInt(day);
  }
  let instance = dayjs(`2025-${_month}-${_day} ${time}`);
  if (instance.isBefore(prevDayjs)) {
    instance = instance.add(12, "h");
  }
  prevDayjs = instance;
  return [instance.format("YYYY-MM-DD HH:mm:ss"), note];
});
console.log(temp1);
// 2025-8-6号
debugger;
